In [1]:
import pandas as pd

### Pandas Selecting Data Via loc[] & iloc[]

We will run through 3 examples of selections with both loc (index labels) and iloc (index positions).

1. Selecting via scalars
2. Selecting via lists
3. Selecting via slices

First, let's create our DataFrame

In [2]:
df = pd.DataFrame([('Foreign Cinema', 'Restaurant', 289.0, 5.2),
                   ('Liho Liho', 'Restaurant', 224.0, 4.3),
                   ('500 Club', 'bar', 80.5, 3.9),
                   ('The Square', 'bar', 25.30, 1.7)],
           columns=('name', 'type', 'AvgBill', 'Rating')
                 )
df.set_index('name', inplace=True)
df

                      type  AvgBill  Rating
name
Foreign Cinema  Restaurant    289.0     5.2
Liho Liho       Restaurant    224.0     4.3
500 Club               bar     80.5     3.9
The Square             bar     25.3     1.7

### 1. Selecting via scalars

To select via scalar (single value), simply pass an index label for loc and and index position for iloc. I'll show a few ways to select a single value, whole row, and whole column.

In [3]:
df.loc['Foreign Cinema', 'type']

'Restaurant'

In [4]:
df.loc[: , 'type']

name
Foreign Cinema    Restaurant
Liho Liho         Restaurant
500 Club                 bar
The Square               bar
Name: type, dtype: object

In [5]:
df.loc["Liho Liho"]

type       Restaurant
AvgBill           224
Rating            4.3
Name: Liho Liho, dtype: object

And via iloc using index position

In [6]:
df.iloc[2, 1]

80.5

In [7]:
df.iloc[:, 1]

name
Foreign Cinema    289.0
Liho Liho         224.0
500 Club           80.5
The Square         25.3
Name: AvgBill, dtype: float64

In [8]:
df.iloc[2]

type        bar
AvgBill    80.5
Rating      3.9
Name: 500 Club, dtype: object

### 2. Selecting via lists

If you wanted multiple items, you can pass a list of labels or positions

In [9]:
df.loc[['Foreign Cinema', '500 Club'], ['AvgBill', 'Rating']]

                AvgBill  Rating
name
Foreign Cinema    289.0     5.2
500 Club           80.5     3.9

In [10]:
df.iloc[[0,2], [0,1]]

                      type  AvgBill
name
Foreign Cinema  Restaurant    289.0
500 Club               bar     80.5

### 3. Selecting via slices

Finally, let's look at how to select multiple items via slices. Slices are when you want to select everything *in between* two items.

In [11]:
df.loc['Foreign Cinema' : '500 Club', 'type' : 'Rating']

                      type  AvgBill  Rating
name
Foreign Cinema  Restaurant    289.0     5.2
Liho Liho       Restaurant    224.0     4.3
500 Club               bar     80.5     3.9

In [12]:
df.iloc[0 : 2, 1 : 2]

                AvgBill
name
Foreign Cinema    289.0
Liho Liho         224.0